compiled provider and tested locally producing correct results for type `FIRST_PARTY` and `KUBERNETES_CONNECTOR`


## First Party
<details>
<summary>terragrunt output</summary>

```
Terraform will perform the following actions:

  # wiz_service_account.this will be created
  + resource "wiz_service_account" "this" {
      + client_id           = (known after apply)
      + client_secret       = (known after apply)
      + created_at          = (known after apply)
      + id                  = (known after apply)
      + last_rotated_at     = (known after apply)
      + name                = "test-first-party"
      + recreate_if_rotated = false
      + type                = "FIRST_PARTY"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Terraform will perform the following actions:

  # wiz_service_account.this will be destroyed
  - resource "wiz_service_account" "this" {
      - client_id           = "" -> null
      - client_secret       = "" -> null
      - created_at          = "2024-01-24T00:37:34.343Z" -> null
      - id                  = "" -> null
      - last_rotated_at     = "2024-01-24T00:37:34.637Z" -> null
      - name                = "test-first-party" -> null
      - recreate_if_rotated = false -> null
      - scopes              = [] -> null
      - type                = "FIRST_PARTY" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy
```

</details>

## Kubernetes Connector
<details>
<summary>terragrunt output</summary>

```
Terraform will perform the following actions:

  # wiz_service_account.this will be created
  + resource "wiz_service_account" "this" {
      + client_id           = (known after apply)
      + client_secret       = (known after apply)
      + created_at          = (known after apply)
      + id                  = (known after apply)
      + last_rotated_at     = (known after apply)
      + name                = "test-k8s-connector"
      + recreate_if_rotated = false
      + type                = "KUBERNETES_CONNECTOR"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Terraform will perform the following actions:

  # wiz_service_account.this will be destroyed
  - resource "wiz_service_account" "this" {
      - client_id           = "" -> null
      - client_secret       = "" -> null
      - created_at          = "2024-01-24T02:06:10.875Z" -> null
      - id                  = "" -> null
      - last_rotated_at     = "2024-01-24T02:06:11.188Z" -> null
      - name                = "test-k8s-connector" -> null
      - recreate_if_rotated = false -> null
      - scopes              = [] -> null
      - type                = "KUBERNETES_CONNECTOR" -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.
```

</details>